#### Terraform Initialization ⚙️ `success`

#### Terraform Validation ✅ `success`

<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```

data.cloudflare_zones.zone_search_external: Reading...
data.cloudflare_zones.zone_search_internal: Reading...
data.cloudflare_zones.zone_search_external: Read complete after 1s [name=pascaliske.dev]
data.cloudflare_zone.zone_external: Reading...
data.cloudflare_zones.zone_search_internal: Read complete after 1s [name=iske.cloud]
data.cloudflare_zone.zone_internal: Reading...
data.cloudflare_zone.zone_external: Read complete after 0s
cloudflare_dns_record.docs: Refreshing state... [id=a40e8470f6e7bd145dc0ae7d7bc823ae]
cloudflare_dns_record.charts: Refreshing state... [id=89c50ff8669abcc19476c8300b3aaab5]
cloudflare_dns_record.wildcard: Refreshing state... [id=a31b457380e75e40b9ae21e10c7d5c92]
data.cloudflare_zone.zone_internal: Read complete after 0s
cloudflare_dns_record.dmarc: Refreshing state... [id=f822111bf1aceaa36010d546f62c6227]
cloudflare_dns_record.dkim: Refreshing state... [id=b655c47c4678e736f1dcab39d93d0e7e]
cloudflare_dns_record.spf: Refreshing state... [id=702428310fb0366086edf0dfb70a8a6d]
cloudflare_dns_record.google: Refreshing state... [id=d4e916fcbb81e0ff639e18adb07dca15]
cloudflare_dns_record.vpn: Refreshing state... [id=b6fc722ed7bb4fceebc3e7989dd74435]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # cloudflare_dns_record.charts will be updated in-place
  ~ resource "cloudflare_dns_record" "charts" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ created_on          = "2022-10-29T10:34:26Z" -> (known after apply)
        id                  = "89c50ff8669abcc19476c8300b3aaab5"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-05-02T11:40:30Z" -> (known after apply)
      ~ name                = "charts.pascaliske.dev" -> "charts"
      ~ proxiable           = true -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
      ~ tags                = [] -> (known after apply)
      + tags_modified_on    = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.dkim will be updated in-place
  ~ resource "cloudflare_dns_record" "dkim" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ created_on          = "2022-10-28T12:06:52Z" -> (known after apply)
        id                  = "b655c47c4678e736f1dcab39d93d0e7e"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2022-10-28T12:06:52Z" -> (known after apply)
      ~ name                = "*._domainkey.iske.cloud" -> "*._domainkey"
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
      ~ tags                = [] -> (known after apply)
      + tags_modified_on    = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.dmarc will be updated in-place
  ~ resource "cloudflare_dns_record" "dmarc" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ created_on          = "2022-10-28T12:06:52Z" -> (known after apply)
        id                  = "f822111bf1aceaa36010d546f62c6227"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2022-10-28T12:06:52Z" -> (known after apply)
      ~ name                = "_dmarc.iske.cloud" -> "_dmarc"
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
      ~ tags                = [] -> (known after apply)
      + tags_modified_on    = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.docs will be updated in-place
  ~ resource "cloudflare_dns_record" "docs" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ created_on          = "2022-10-29T10:34:26Z" -> (known after apply)
        id                  = "a40e8470f6e7bd145dc0ae7d7bc823ae"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-05-02T11:40:30Z" -> (known after apply)
      ~ name                = "k8s.pascaliske.dev" -> "k8s"
      ~ proxiable           = true -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
      ~ tags                = [] -> (known after apply)
      + tags_modified_on    = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.vpn will be updated in-place
  ~ resource "cloudflare_dns_record" "vpn" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ created_on          = "2022-10-28T12:06:52Z" -> (known after apply)
        id                  = "b6fc722ed7bb4fceebc3e7989dd74435"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-04-27T02:00:27Z" -> (known after apply)
      ~ name                = "vpn.iske.cloud" -> "vpn"
      ~ proxiable           = true -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
      ~ tags                = [] -> (known after apply)
      + tags_modified_on    = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.wildcard will be updated in-place
  ~ resource "cloudflare_dns_record" "wildcard" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ created_on          = "2023-04-12T18:17:22Z" -> (known after apply)
        id                  = "a31b457380e75e40b9ae21e10c7d5c92"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2023-04-12T18:17:22Z" -> (known after apply)
      ~ name                = "*.pascaliske.dev" -> "*"
      ~ proxiable           = true -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
      ~ tags                = [] -> (known after apply)
      + tags_modified_on    = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 0 to add, 6 to change, 0 to destroy.

```

</details>

*Pushed by: @renovate[bot], Action: `pull_request`, Workflow: `Terraform`*